           
           05 KUNDE-ID PIC X(10).
           05 KONTO-ID PIC X(10).
           05 KONTO-TYPE PIC X(10).
           05 BALANCE PIC Z(6)9V99.
           05 VALUTA-KD PIC X(3).
           