                

                05 CPR PIC X(15).
                05 NAVN PIC X(30).
                05 ADRESSE PIC X(50).
                05 FØDSELSDATO PIC X(10).
                05 KONTO-ID PIC X(15).
                05 REG-NR PIC X(4).
                05 BELØB PIC S9(9)V99 COMP-3.
                05 VALUTA PIC X(3).
                05 TRANSAKTIONSTYPE PIC X(15).
                05 BUTIK PIC X(20).
                05 TIDSPUNKT PIC X(26).

                