           

               05 REG-NR PIC X(4).
               05 BANKNAVN PIC X(30).
               05 BANKADRESSE PIC X(50).
               05 TELEFON PIC X(15).
               05 EMAIL PIC X(31).

               