                

                05 CPR PIC X(15).
                05 NAVN PIC X(30).
                05 ADRESSE PIC X(50).
                05 FØDSELSDATO PIC X(11).
                05 KONTO-ID PIC X(14).
                05 REG-NR PIC X(12).
                05 BELØB PIC X(9).
                05 VALUTA PIC X(4).
                05 TRANSAKTIONSTYPE PIC X(20).
                05 BUTIK PIC X(20).
                05 TIDSPUNKT PIC X(26).

                